"""Exercises window."""
from PyQt5.QtWidgets import QPushButton, QVBoxLayout, QWidget

from Question import FillBlankQuestion, MultipleChoiceQuestion, QuestionWidget


class ExercisesWidget(QWidget):
    """Widget for choosing a set of exercises."""

    def __init__(self):
        """Initialize ExercisesWidget."""
        super().__init__()

        layout = QVBoxLayout()
        self.setLayout(layout)

        exc1 = QPushButton('Ασκήσεις Μαθήματος 1')
        exc2 = QPushButton('Ασκήσεις Μαθήματος 2')
        exc3 = QPushButton('Ασκήσεις Μαθήματος 3')
        exc4 = QPushButton("Τελικό Διαγώνισμα")
        back = QPushButton('Πίσω')

        layout.addWidget(exc1)
        layout.addWidget(exc2)
        layout.addWidget(exc3)
        layout.addWidget(exc4)
        layout.addWidget(back)

        exc1.clicked.connect(self.Exercises1)
        exc2.clicked.connect(self.Exercises2)
        exc3.clicked.connect(self.Exercises3)
        exc4.clicked.connect(self.Exercises4)
        back.clicked.connect(self.Back)

    def Exercises2(self) -> None:
        """Second set of exercises."""
        questions = [
            FillBlankQuestion("Μία δεξαμενή πετρελαίου σε μια πολυκατοικία χωράει 2000lt, Ο διαχειριστής σε μια μέτρηση βρήκε ότι ήταν γεμάτη κατά τα 3/4. Πόσα λίτρα πετρέλαιο είχε η δεξαμενή;", " &lt", ["1500"]),
            FillBlankQuestion("Τα 3/5 ενός μπαχαρικού κοστίζουν 27Ευρώ. Πόσο κοστίζουν τα 8/9 του κιλού;", " &Ευρώ", ["45"]),
            FillBlankQuestion("Συμπλήρωσε τα παρακάτω κενά:", """
(α)	Στο κλάσμα κ/λ οι αριθμοί κ και λ ονομάζονται & και &
(β) Ισχύει ότι: (α) α/1 = & (β) α/α  = & (γ) 0/α = &
(γ) Η φράση 'το μέρος κ/λ ενός μεγέθους Α' εκφράζει τον χωρισμό του μεγέθους Α σε & μεγέθη.
""", ["αριθμητής", "παρονομαστής", "α", "1", "0", "λ"]),
            MultipleChoiceQuestion("Τα κλάσματα 3/4, 2/3, 7/9, 10/9, 18/20, είναι όλα μικρότερα της μονάδας.", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("Αν το 1/5 ενός κιλού καρύδια είναι 14 καρύδια, το κιλό περιέχει 70 καρύδια;", ["Σωστό", "Λάθος"], 0),
            FillBlankQuestion("Από μία τούρτα περίσσεψαν 4 κομμάτια τα οποία αποτελούν τα 2/7 της τούρτας. Πόσα ήταν αρχικά όλα τα κομμάτια της τούρτας;", " &κομμάτια", ["14"]),
            FillBlankQuestion("Βρες ποιο μέρος του κιλού είναι τα:", """
(α) 100 γραμμάρια &
(β) 250 γραμμάρια &
(γ) 500 γραμμάρια &
(δ) 600 γραμμάρια &
""", ["1/10", "1/4", "1/2", "3/5"]),
            FillBlankQuestion("Ποιό μέρος:", """
(α) του μήνα &
(β) του εξαμήνου &
(γ) του έτους &
είναι οι 15 μέρες; (Έστω ότι ο μήνας έχει 15 ημέρες και ο χρόνος 365)
""", ["1/2", "1/12", "3/73"]),
            FillBlankQuestion("Ένα κατάστημα κάνει έκπτωση στα είδη του ίση με τα 2/5 της αρχικής τιμής τους. Ένα φόρεμα κόστιζε 90€ πριν την έκπτωση. Υπολόγισε πόσα ευρώ έκπτωση έγινε στο φόρεμα και πόσο θα πληρώσουμε για να το αγοράσουμε.", " &€", ["36"]),
            FillBlankQuestion("Σε μία τάξη τα 3/8 των μαθητών μαθαίνουν αγγλικά. Να βρεις πόσους μαθητές έχει η τάξη, αν γνωρίζεις ότι αυτοί που μαθαίνουν αγγλικά είναι 12 μαθητές.", "Η τάξη έχει συνολικά & μαθητές.", ["32"]),
            FillBlankQuestion("Σε ένα ορθογώνιο παραλληλόγραμμο η μια πλευρά του είναι 33 εκατοστά και η άλλη τα 3/11 της πρώτης.", "H περίμετρος του ορθογωνίου είναι & εκατοστά.", ["84"]),
            FillBlankQuestion("Ένα ευθύγραμμο τμήμα ΑΒ έχει μήκος 5 εκατοστά. Να βρείς το μήκος:", """
(α) ενός ευθύγραμμου τμήματος ΓΔ με μήκος τα 8/10 του ΑΒ: &cm
(β) ενός ευθύγραμμου τμήματος ΕΖ με μήκος τα 6/5 του ΑΒ &cm
""", ["4", "6"]),
            MultipleChoiceQuestion("Αν ισχύει α/β = γ/δ, τότε οι όροι α, β, γ και δ συνδέονται με τη σχέση:", ["α⋅β=γ⋅δ", "α⋅γ=β⋅δ", "γ⋅δ=β⋅α"], 0),
            MultipleChoiceQuestion("Τα κλάσματα 2/3, 18/27 είναι ισοδύναμα", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("Τα κλάσματα 3/4, 1/2 είναι ισοδύναμα", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("Τα κλάσματα 7/8, 30/40 είναι ισοδύναμα", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("Τα κλάσματα 13/14, 26/28 είναι ισοδύναμα", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("Το κλάσμα 10/25 απλοποιήτε με το 5", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("Το κλάσμα 3/5 είναι ανάγωγο", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("0/4 = 0/10", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("5/5 = 41/41", ["Σωστό", "Λάθος"], 0),
        ]

        stack = self.parentWidget()
        question = QuestionWidget(questions)
        stack.addWidget(question)
        stack.setCurrentWidget(question)

    def Exercises1(self):
        """First set of exercises."""
        questions = [
            FillBlankQuestion("Ποιοι είναι οι τρεις προηγούμενοι αριθμοί του 289 και ποιοι οι δύο επόμενοι;", " & & & 289 & &", ["286", "287", "288", "290", "291"]),
            FillBlankQuestion("Τοποθέτησε σε αύξουσα σειρά τους αριθμούς: 3.515, 4.800, 3.620, 3.508, 4.801.", " & & & & & & & & &", ["3508", "<", "3515", "<", "3620", "<", "4800", "<", "4801"]),
            FillBlankQuestion("Τοποθέτησε το κατάλληλο σύμβολο: <, =, >, στο κενό μεταξύ των ακόλουθων αριθμών:", """
            (α) 45 & 45
            (β) 38 & 36
            (γ) 456 & 465
            (δ) 8.765 & 8.970
            (ε) 90.876 & 86.945
            (στ) 345 & 5.690""", ["=", ">", "<", "<", ">", "<"]),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Στον αριθμό 5780901 το μηδέν δηλώνει απουσία δεκάδων και χιλιάδων""", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Δέκα χιλιάδες είναι μία δεκάδα χιλιάδα""", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Σε μια πενταήμερη εκδρομή θα γίνουν πέντε διανυχτερεύσεις""", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Από τον αριθμό 32 ως τον αριθμό 122 υπάρχουν (χωρίς να μετράμε τον 122) 91 αριθμοί""", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Σε οκτώ ημέρες από σήμερα, που είναι Πέμπτη,θα είναι Παρασκευή""", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Από την 12η σελίδα του βιβλίου μέχρι και την 35η (χωρίς να μετράμε την 35η) είναι 24 σελίδες""", ["Σωστό", "Λάθος"], 1),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Δεν υπάρχει φυσικός αριθμός μεταξύ των αριθμών 2 και 3""", ["Σωστό", "Λάθος"], 0),
            FillBlankQuestion("Στρογγυλοποίησε στην πλησιέστερη εκατοντάδα τους αριθμούς: ", """
            (α) 345 &
            (β) 761 &
            (γ) 659 &
            (δ) 2.567 &
            (ε) 9.532 &
            (στ) 123.564 &
            (ζ) 34.564 &
            (η) 31.549 &
            (θ) 8.765 &""", ["300", "800", "700", "2600", "9500", "123600", "34600", "31600", "8800"]),
            FillBlankQuestion("Στρογγυλοποίησε τον αριθμό 7.568.349 στις πλησιέστερες:", """
            (α) δεκάδες &
            (β) εκατοντάδες &
            (γ) χιλιάδες &
            (δ) δεκάδες χιλιάδες &
            (ε) εκατοντάδες χιλιάδες &""", ["7568350", "7568300", "7568000", "7570000", "7600000"]),
            FillBlankQuestion("Συμπλήρωσε τα παρακάτω κενά", """
            (α) H ιδιότητα α + β = β + α λέγεται &
            (β)	Η ιδιότητα α + β + γ = α + (β + γ) = (α + β) + γ λέγεται &
            (γ) Ο αριθμός που προστίθεται σε αριθμό α και δίνει άθροισμα α είναι το &
            (δ) Το αποτέλεσμα της αφαίρεσης λέγεται &
            (ε) Σε μια αφαίρεση οι αριθμοί Μ, Α και Δ (με αυτή τη σειρά) συνδέονται με τη σχέση &
            (στ) Η ιδιότητα α · β = β · α λέγεται &
            (ζ)	Η ιδιότητα α · (β · γ) = (α · β) · γ λέγεται &
            (η) Η ιδιότητα α · (β + γ) = α · β + α · γ λέγεται &""", ["αντιμεταθετική", "προσεταιριστική ιδιότητα", "μηδέν", "διαφορά", "Μ = Α + Δ", "αντιμεταθετική", "προσεταιριστική", "επιμεριστική"]),
            FillBlankQuestion("Συμπλήρωσε τα γινόμενα:", """
            (α) 52· [ & ] = 5.200
            (β) 37· [ & ] = 370
            (γ) 490· [ & ] = 4.900.000""", ["100", "10", "10000"]),
            FillBlankQuestion("Ο Άρης γεννήθηκε το 1983 και είναι 25 χρόνια μικρότερος από τον πατέρα του.", """
            (α) Πόσων χρονών είναι ο Άρης σήμερα; &
            (β) Πότε γεννήθηκε ο πατέρας του; & """, ["39", "1958"]),
        ]

        stack = self.parentWidget()
        question = QuestionWidget(questions)
        stack.addWidget(question)
        stack.setCurrentWidget(question)

    def Exercises3(self):
        """Third set of exercises."""
        questions = [
            FillBlankQuestion("Γράψε ως κλάσματα τα πηλίκα των διαιρέσεων:", """
Παράδειγμα:
2 : 4 = 2/4
4 : 5 = &
9 : 16 &
25 : 79 &
""", ["4/5", "9/16", "25/79"]),
            FillBlankQuestion("Ποιά διαίρεση παριστάνει καθένα από τα κλάσματα: ", """
Παράδειγμα:
2/4 = 2 : 4
2/21 = &
19/3 = &
77/105 = &
""", ["2 : 21", "19 : 3", "77 : 105"]),
            FillBlankQuestion("Γράψε καθένα από τα παρακάτω κλάσματα, ως δεκαδικό αριθμό: (i) με προσέγγιση εκατοστού και (ii) με προσέγγιση χιλιοστού:", """
(α) 7/16: (i) & (ii) &
(β) 21/17: (i) & (ii) &
(γ) 20/95: (i) & (ii) &
""", ["0,437", "0,4375", "1,588", "1,5882", "0,210", "0,2105"]),
            FillBlankQuestion("Γράψε ως δεκαδικό αριθμό, καθένα από τα παρακάτω δεκαδικά κλάσματα:", """
(α) 58/10: &
(β) 3/100: &
(γ) 5025/100: &
(δ) 1024/100: &
""", ["5,8", "0,03", "50,25", "10,24"]),
            FillBlankQuestion("Να βρεις το ψηφίο των χιλιοστών και των δεκάκις χιλιοστών στους παρακάτω αριθμούς:", """
(α) 5,8909 &
(β) 90,0005: &
(γ) 7,534: &
""", ["9", "5", "6"]),
            FillBlankQuestion("Τοποθέτησε το κατάλληλο σύμβολο <, = ή >, μεταξύ των αριθμών:", """
 (α) 45,345 & 45,413
 (β) 980,19 & 899,01
 (γ) 7,534 & 7,5340
""", ["<", ">", "="]),
            MultipleChoiceQuestion("Ο αριθμός 25,62 στρογυλοποιημένος στο πλησιέστερο δέκατο, γίνεται ίσος με:", ["25,7", "25,6", "26"], 1),
            MultipleChoiceQuestion("Ο αριθμός 1,342 στρογυλοποιημένος στην πλησιέστερη μονάδα, γίνεται ίσος με:", ["1,34", "1,35", "1,4", "1", "1,3"], 3),
            MultipleChoiceQuestion("Ο αριθμός 13,8432 στρογυλοποιημένος στο πλησιέστερο εκατοστό, γίνεται ίσος με:", ["13,844", "14", "13,843"], 2),
        ]

        stack = self.parentWidget()
        question = QuestionWidget(questions)
        stack.addWidget(question)
        stack.setCurrentWidget(question)

    def Exercises4(self) -> None:
        """Excercises for the final exam"""
        questions = [
            FillBlankQuestion("Στρογγυλοποίησε τον αριθμό 7.568.349 στις πλησιέστερες:", """
            (α) δεκάδες &
            (β) εκατοντάδες &
            (γ) χιλιάδες &
            (δ) δεκάδες χιλιάδες &
            (ε) εκατοντάδες χιλιάδες &""", ["7568350", "7568300", "7568000", "7570000", "7600000"]),
            FillBlankQuestion("Γράψε καθένα από τα παρακάτω κλάσματα, ως δεκαδικό αριθμό: (i) με προσέγγιση εκατοστού και (ii) με προσέγγιση χιλιοστού:", """
(α) 7/16: (i) & (ii) &
(β) 21/17: (i) & (ii) &
(γ) 20/95: (i) & (ii) &
""", ["0,437", "0,4375", "1,588", "1,5882", "0,210", "0,2105"]),
            FillBlankQuestion("Ποιό μέρος:", """
            (α) του μήνα &
            (β) του εξαμήνου &
            (γ) του έτους &
            είναι οι 15 μέρες; (Έστω ότι ο μήνας έχει 15 ημέρες και ο χρόνος 365)
            """, ["1/2", "1/12", "3/73"]),
            FillBlankQuestion("Να βρεις το ψηφίο των χιλιοστών και των δεκάκις χιλιοστών στους παρακάτω αριθμούς:", """
            (α) 5,8909 &
            (β) 90,0005: &
            (γ) 7,534: &
            """, ["9", "5", "6"]),
            FillBlankQuestion("Στρογγυλοποίησε στην πλησιέστερη εκατοντάδα τους αριθμούς: ", """
            (α) 345 &
            (β) 761 &
            (γ) 659 &
            (δ) 2.567 &
            (ε) 9.532 &
            (στ) 123.564 &
            (ζ) 34.564 &
            (η) 31.549 &
            (θ) 8.765 &""", ["300", "800", "700", "2600", "9500", "123600", "34600", "31600", "8800"]),
            MultipleChoiceQuestion("""Επέλεξε Σωστό ή Λάθος:
            Δεν υπάρχει φυσικός αριθμός μεταξύ των αριθμών 2 και 3""", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("Αν το 1/5 ενός κιλού καρύδια είναι 14 καρύδια, το κιλό περιέχει 70 καρύδια;", ["Σωστό", "Λάθος"], 0),
            MultipleChoiceQuestion("Ο αριθμός 13,8432 στρογυλοποιημένος στο πλησιέστερο εκατοστό, γίνεται ίσος με:", ["13,844", "14", "13,843"], 2),
            MultipleChoiceQuestion("Ο αριθμός 25,62 στρογυλοποιημένος στο πλησιέστερο δέκατο, γίνεται ίσος με:", ["25,7", "25,6", "26"], 1),
            MultipleChoiceQuestion("Ο αριθμός 1,342 στρογυλοποιημένος στην πλησιέστερη μονάδα, γίνεται ίσος με:", ["1,34", "1,35", "1,4", "1", "1,3"], 3),
        ]
        
        stack = self.parentWidget()
        question = QuestionWidget(questions)
        stack.addWidget(question)
        stack.setCurrentWidget(question)


    def Back(self) -> None:
        """Go back to main page.

        Use the parent widget (QStacked) to set the previous widget as the current; then delete this one
        """
        parent = self.parentWidget()

        # print(parent.currentIndex())
        old_widget = parent.currentWidget()
        parent.setCurrentIndex(parent.currentIndex() - 1)
        parent.removeWidget(old_widget)
